importPackage(Packages.packet.creators);

var status = -1;
var SortbySort = 0;


/* 붉은 소울 조각 : 락스피릿, 교도관 아니, 드래곤 라이더, 렉스, 무공, 발록, 크세르크세스 */
var RedSoulL = new Array(2591010, 2591011, 2591012, 2591013, 2591014, 2591015, 2591016, 2591017, 2591018, 2591019, 2591020, 2591021, 2591022, 2591023, 2591024, 2591025, 2591026, 2591027, 2591028, 2591029, 2591030, 2591031, 2591032, 2591033, 2591034, 2591035, 2591036, 2591037, 2591038, 2591039, 2591040, 2591041, 2591042, 2591043, 2591044, 2591045, 2591046, 2591047, 2591048, 2591049, 2591050, 2591051, 2591052, 2591053, 2591054, 2591148, 2591149, 2591150, 2591151, 2591152, 2591153, 2591154);

/* 노란 소울 조각 : 핑크빈, 반 레온, 시그너스, 자쿰, 에피네아, 아카이럼, 피아누스, 힐라 */
var YelSoulL = new Array(2591055, 2591056, 2591057, 2591058, 2591059, 2591060, 2591061, 2591062, 2591063, 2591064, 2591065, 2591066, 2591067, 2591068, 2591069, 2591070, 2591071, 2591072, 2591073, 2591074, 2591075, 2591076, 2591077, 2591078, 2591079, 2591080, 2591081, 2591082, 2591155, 2591156, 2591157, 2591158, 2591159, 2591160, 2591161, 2591162, 2591163, 2591187, 2591188, 2591189, 2591190, 2591191, 2591192, 2591193, 2591218, 2591219, 2591220, 2591221, 2591222, 2591223, 2591224, 2591225, 2591226, 2591227, 2591228, 2591229, 2591230, 2591231, 2591232, 2591233);

/* 파란 소울 조각 : 블랙 슬라임, 매그너스, 무르무르, 모카딘, 카리아인, CQ57, 줄라이, 플레드 */
var BluSoulL = new Array(2591249, 2591250, 2591251, 2591252, 2591253, 2591254, 2591255, 2591256, 2591257, 2591258, 2591259, 2591260, 2591261, 2591262, 2591263, 2591264, 2591288, 2591289, 2591290, 2591291, 2591292, 2591293, 2591294, 2591295, 2591296, 2591297, 2591298, 2591299, 2591300, 2591301, 2591302, 2591303, 2591304, 2591305, 2591306, 2591307, 2591308, 2591309, 2591310, 2591311, 2591312, 2591313, 2591314, 2591315, 2591316, 2591317, 2591318, 2591319, 2591320, 2591321, 2591322, 2591323, 2591324, 2591325, 2591326, 2591327, 2591328, 2591329, 2591330, 2591331, 2591332, 2591333, 2591334, 2591335, 2591336, 2591337, 2591338, 2591339, 2591340, 2591341
);
var RandScrL = new Array(2040002, 2040005, 2040026, 2040031, 2040302, 2040318, 2040323, 2040328, 2040329, 2040330, 2040331, 2040402, 2040419, 2040422, 2040427, 2040502, 2040505, 2040514, 2040517, 2040534, 2040602, 2040619, 2040622, 2040627, 2040702, 2040705, 2040708, 2040727, 2040802, 2040805, 2040825, 2040902, 2040925, 2040928, 2040933, 2041002, 2041005, 2041008, 2041011, 2041014, 2041017, 2041020, 2041023, 2041058, 2041102, 2041105, 2041108, 2041111, 2041302, 2041305, 2041308, 2041311, 2042102, 2042202, 2042302, 2042402, 2043002, 2043019, 2043102, 2043114, 2043202, 2043214, 2043302, 2043402, 2043602, 2043702, 2043802, 2044002, 2044014, 2044015, 2044102, 2044114, 2044202, 2044214, 2044302, 2044314, 2044402, 2044414, 2044502, 2044602, 2044702, 2044802, 2044809, 2044902, 2045202, 2045302, 2590004, 2590005, 2590006, 2590007, 2590008, 2590009, 2590010, 2590014, 2049100, 2049122, 2049300, 2049301, 5064000, 5064100, 5064300, 2048314, 2048315, 2049400, 2049401, 2049402, 2040239, 2040358, 2040449, 2040565, 2040649, 2040776, 2040871, 2046002, 2046003, 2046102, 2046103, 2046022, 2046023, 2046117, 2046204, 2046205, 2046206, 2046207, 2046241, 2046242, 2046243, 2046244, 2046252, 2046304, 2046305, 2046306, 2046307, 2046332, 2046333, 2046334, 2046335);

var redN = 2023265;
var YelN = 2023266;
var BluN = 2023267;
var RdrN = 4001832;


var oldsel = 0;
function start() {
    status = -1;
    action(1, 0, 0);
}
function action(mode, type, selection) {
	if (mode == -1) {
	cm.dispose();
	} else {
	if (mode == 0) {
	cm.dispose();            
	return;        
	}        
	if (mode == 1)            
	status++;        
	else           
	status--;    

	if (status == 0) {

	var chat = "저는 벽을 넘고 싶어하는 사람이지요. 저는 현자도 아니고 철학자도 아닙니다. 다만, 저 빛의 너머에 무엇이 있을지 궁금할 뿐입니다…\r\n#b";
	chat += "#L0##i"+redN+"#  #z"+redN+"# 교환하기#l\r\n";
	chat += "#L1##i"+YelN+"#  #z"+YelN+"# 교환하기#l\r\n";
	chat += "#L2##i"+BluN+"#  #z"+BluN+"# 교환하기#l\r\n";
	chat += "#L3##i"+RdrN+"# #z"+RdrN+"# 교환하기#l\r\n";

	cm.sendSimple(chat);

	} else if (status == 1) {
	sL = selection;
	var itemChoice = sL == 0 ? 2023265 : sL == 1 ? 2023266 : sL == 2 ? 2023267 : 4001832;
	var itemQntity = sL == 3 ? 100 : 10;
	var PlusSendMg = sL == 0 ? "락스피릿, 교도관 아니, 드래곤 라이더, 렉스, 무공, 발록, 크세르크세스의 소울" :
			 sL == 1 ? "핑크빈, 반 레온, 시그너스, 자쿰, 에피네아, 아카이럼, 피아누스, 힐라의 소울" :
			 sL == 2 ? "블랙 슬라임, 매그너스, 무르무르, 모카딘, 카리아인, CQ57, 줄라이, 플레드의 소울" :
			 "쉽게 구할 수 없는 희소성이 강한 주문서";
	SortbySort = sL == 0 ? 1 : sL == 1 ? 2 : sL == 2 ? 3 : 4
	cm.sendYesNo("#b#z"+itemChoice+"##k을 교환하고 싶으시군요… #e"+itemQntity+"개#n를 가지고 오시면 #b"+PlusSendMg+" 중 1개#k를 드리도록 하죠…");

	} else if (status == 2) {

	RedSoul = RedSoulL[Math.floor(Math.random() * RedSoulL.length)];
	YelSoul = YelSoulL[Math.floor(Math.random() * YelSoulL.length)];
	BluSoul = BluSoulL[Math.floor(Math.random() * BluSoulL.length)];
	RandScr = RandScrL[Math.floor(Math.random() * RandScrL.length)];

	var lastItem = SortbySort == 1 ? 2023265 : SortbySort == 2 ? 2023266 : SortbySort == 3 ? 2023267 : 4001832;
	var GiveItem = SortbySort == 1 ? RedSoul : SortbySort == 2 ? YelSoul : SortbySort == 3 ? BluSoul : RandScr;
	var lastNeed = SortbySort == 4 ? 100 : 10;
	var ItemKorn = SortbySort == 1 ? "붉은 소울 조각" : SortbySort == 2 ? "노란 소울 조각" : SortbySort == 3 ? "푸른 소울 조각" : "주문의 흔적";
		if(cm.haveItem(lastItem, lastNeed)) {
			if(cm.canHold(lastItem)) {
				cm.gainItem(lastItem, -lastNeed);
				cm.gainItem(GiveItem, 1)
				cm.sendNext("아이템을 모두 모아왔군요… 약속한대로 아이템을 드리도록 하지요.\r\n\r\n#fUI/UIWindow.img/QuestIcon/4/0#\r\n#i"+GiveItem+"# #z"+GiveItem+"#");
				cm.getPlayer().send(MainPacketCreator.getGMText(6, "아이템을 잃었습니다. ("+ItemKorn+" "+lastNeed+"개)"));
				cm.getPlayer().send(MainPacketCreator.getGMText(6, "아이템을 획득하였습니다. ("+Packages.server.items.ItemInformation.getInstance().getName(GiveItem)+")"));
			}
			else {
			cm.sendOk("소비 탭의 공간이 부족한 것 같군요… 두 칸 이상의 여유 공간을 확보한 뒤 다시 시도해보시기 바랍니다…");
			}
		} else {
		cm.sendOk("아이템의 개수가 부족한 것 같군요… 제 기억에 따르면 "+lastNeed+"개 였을텐데 말이죠…?");
		}
	cm.dispose();
	}
}
}