
var status;
var select;
var need = 3994720
var image = "#b#i"+need+"# #z"+need+"##k"
var image2 = "#b#z"+need+"##k"

var arr = "3010000, 3010001, 3010007, 3010008, 3010009, 3010018, 3010025, 3010060, 3010061, 3010062, 3010063, 3010064, 3010065, 3010066, 3010067, 3010080, 3010081, 3010082, 3010083, 3010084, 3010086, 3010092, 3010097, 3010107, 3010108, 3010109, 3010110, 3010113, 3010114, 3010115, 3010021, 3010049, 3010055, 3010129, 3010130, 3010131, 3010132, 3010133, 3010134, 3010154, 3010157, 3010186, 3010191, 3010194, 3010202, 3010203, 3010205, 3010206, 3010207, 3010208, 3010211, 3010224, 3010225, 3010257, 3010279, 3010288, 3010297, 3010298, 3010307, 3010314, 3010315, 3010316, 3010317, 3010318, 3010319, 3010320, 3010321, 3010322, 3010354, 3010360, 3010364, 3010365, 3010368, 3010369, 3010370, 3010371, 3010373, 3010374, 3010375, 3010376, 3010377, 3010383, 3010390, 3010397, 3010402, 3010403, 3010404, 3010405, 3010406, 3010421, 3010423, 3010429, 3010430, 3010431, 3010432, 3010433, 3010434, 3010435, 3010436, 3010437, 3010438, 3010439, 3010440, 3010441, 3010442, 3010443, 3010444, 3010445, 3010446, 3010447, 3010448, 3010449, 3010450, 3010451, 3010452, 3010455, 3010457, 3010458, 3010459, 3010464, 3010465, 3010493, 3010500, 3010501, 3010502, 3010503, 3010504, 3010505, 3010506, 3010512, 3010513, 3010514, 3010515, 3010516, 3010517, 3010518, 3010519, 3010520, 3010521, 3010522, 3010523, 3010524, 3010525, 3010526, 3010530, 3010531, 3010532, 3010533, 3010534, 3010535, 3010536, 3010537, 3010538, 3010539, 3010540, 3010541, 3010542, 3010543, 3010544, 3010545, 3010546, 3010547, 3010548, 3010549, 3010550, 3010551, 3010552, 3010553, 3010554, 3010555, 3010556, 3010557, 3010558, 3010559, 3010560, 3010561, 3010562, 3010563, 3010564, 3010565, 3010566, 3010567, 3010568, 3010569, 3010570, 3010571. 3010572, 3010573, 3010574, 3010575, 3010576, 3010577, 3010578, 3010579, 3010580, 3010581, 3010582, 3010584, 3010585, 3010587, 3010589, 3010590, 3010592, 3010593, 3010596, 3010597, 3010598, 3010600, 3010601, 3010611, 3010612, 3010613, 3012017, 3010622, 3010623, 3010624, 3010636, 3010637, 3010638, 3010639, 3010640, 3010641, 3010642, 3010643, 3010644, 3010651, 3010652, 3010653, 3010654, 3010655, 3010656, 3010659, 3010662, 3010672, 3010673, 3010674, 3010675, 3010676, 3010677, 3010678, 3010679, 3010680, 3010681, 3010682, 3010683, 3010685, 3010690, 3010691, 3010692, 3010693, 3010694, 3010695, 3010697, 3010700, 3010702, 3010703, 3010704, 3010705, 3010708, 3010719, 3010720, 3010721, 3010722, 3010723, 3010733, 3010734, 3010735, 3010742, 3010743, 3010744, 3010757, 3010760, 3010761, 3010766, 3010767, 3010783, 3010797, 3010798, 3010800, 3010801, 3010802, 3010803, 3010804, 3010810, 3010811, 3010812, 3010814, 3010815, 3010835, 3010844, 3010851, 3010852, 3010854, 3014000, 3014001, 3014002, 3014003, 3014004, 3014005"

var arr2 = "2000000, 2000001"

var arr3 = "5000000, 5000001, 5000002, 5000003, 5000004, 5000005, 5000006, 5000007, 5000008, 5000009, 5000010, 5000011, 5000012, 5000013, 5000014, 5000015, 5000017, 5000020, 5000021, 5000022, 5000023, 5000024, 5000026, 5000040, 5000041, 5000042, 5000043, 5000054, 5000064, 5000065, 5000068, 5000072, 5000083, 5000084, 5000089, 5000090, 5000091, 5000152, 5000171, 5000201, 5000202, 5000206, 5000211, 5000215, 5000216, 5000217, 5000221, 5000225, 5000228, 5000229, 5000230, 5000231, 5000232, 5000233, 5000237, 5000238, 5000239, 5000240, 5000243, 5000244, 5000245, 5000249, 5000250, 5000251, 5000256, 5000257, 5000258, 5000261, 5000271, 5000272, 5000273, 5000275, 5000276, 5000277, 5000281, 5000282, 5000283, 5000290, 5000291, 5000292. 5000293 ,5000294, 5000295, 5000296, 5000297, 5000298, 5000299, 5000309, 5000310, 5000311, 5000312, 5000314, 5000315, 5000317, 5000320, 5000321, 5000322, 5000328, 5000330, 5000331, 5000332, 5000341, 5000342, 5000343, 5000344, 5000352, 5000353, 5000354, 5000365, 5000366, 5000367, 5000368, 5000375, 5000376, 5000377, 5000381, 5000383, 5000385, 5000386, 5000387"

function start() {
    status = -1;
    action(1, 1, 0);
}

function action(mode, type, selection) {
    if (mode < 0) {
        cm.dispose();
    return;
    } else {
        if (mode == 1)
            status++;
        else
            status--;
        if (status == 0) {
            var text = "제 이름이 있는 금화는 엄청난 가치가 있다는 사실 알고 계시나요? 만약 #b#h ##k님이 발견하시면 그건 큰 행운일거에요.\r\n\r\n";
	text += "#fUI/UIWindow2.img/UtilDlgEx/list1#\r\n";
	text += "#b#L0#"+image+" 10개#k로 의자 교환#k#l\r\n";
	text += "#b#L1#"+image+" 20개#k로 라이딩 교환#k#l\r\n";
	text += "#b#L2#"+image+" 30개#k로 펫 교환#k#l\r\n";
            cm.sendSimple(text);
        } else if(status == 1) {
            if (selection == 0) {
                if (cm.haveItem(need, 10)) {
		    cm.sendYesNo("정말로 #e의자#n를 원하시는게 맞으신가요? "+image2+" #b10개#k가 소모되고 결과에 대한 모든 책임은 #h #님에게 있어요…. 그래도 계속 진행하시겠어요?");
		    select = 0;
                } else {
                    cm.sendNext("#e의자#n을 원하는 #h #님의 마음은 이해하지만, "+image2+"가 없으면 저도 의자를 드리기가 곤란해요…. 금화를 다 모으신 뒤에 저를 찾아와주세요. 그 때까지 #h #님을 기다리고 있을게요.");
		    cm.dispose();
                }

            } else if (selection == 1) {
                if (cm.haveItem(need, 20)) {
		    cm.sendYesNo("정말로 #e라이딩#n를 원하시는게 맞으신가요? "+image2+" #b20개#k가 소모되고 결과에 대한 모든 책임은 #h #님에게 있어요…. 그래도 계속 진행하시겠어요?");
		    select = 1;
		} else {
                    cm.sendNext("#e라이딩#n을 원하는 #h #님의 마음은 이해하지만, "+image2+"가 없으면 저도 라이딩을 드리기가 곤란해요…. 금화를 다 모으신 뒤에 저를 찾아와주세요. 그 때까지 #h #님을 기다리고 있을게요.");
		    cm.dispose();
		}

	    } else if (selection == 2) {
                if (cm.haveItem(need, 30)) {
		    cm.sendYesNo("정말로 #e펫#n을 원하시는게 맞으신가요? "+image2+" #b30개#k가 소모되고 결과에 대한 모든 책임은 #h #님에게 있어요…. 그래도 계속 진행하시겠어요?");
		    select = 2;
		} else {
                    cm.sendNext("#e펫#n을 원하는 #h #님의 마음은 이해하지만, "+image2+"가 없으면 저도 펫을 드리기가 곤란해요…. 금화를 다 모으신 뒤에 저를 찾아와주세요. 그 때까지 #h #님을 기다리고 있을게요.");
		    cm.dispose();
		}        
            } else {
                cm.dispose();
            }
	} else if (status == 2) {
   var chair = arr.split(",")[Math.floor(Math.random()*299)/1];
   var riding = arr2.split(",")[Math.floor(Math.random()*1+1)/1];
   var pet = arr3.split(",")[Math.floor(Math.random()*110+1)/1];
            if (select == 0) {
                if (cm.canHold(3010001)) {
                    cm.gainItem(need, -10);
                    cm.gainItem(chair, 1);
	      cm.updateChar();
		    cm.sendNext(""+image+"를 정말로 저에게 주시는 건가요? 사실 그렇게 가치가 큰 것도 아니지만 저를 믿어준 #h #님을 위해 드리는 작은 선물입니다.\r\n\r\n#fUI/UIWindow.img/QuestIcon/4/0#\r\n#i"+chair+"# #z"+chair+"#");
                } else {
                    cm.sendNext("죄송하지만 인벤토리 공간이 충분하지 않으신 것 같네요. #b설치#k탭의 인벤토리 공간을 비워주세요.");
                }
                cm.dispose();
            } else if (select == 1) {
		if (cm.canHold(3010001)) {
                    cm.gainItem(need, -3);
                    cm.gainItem(riding, 1);
	      cm.updateChar();
		    cm.sendNext(""+image+"를 정말로 저에게 주시는 건가요? 사실 그렇게 가치가 큰 것도 아니지만 저를 믿어준 #h #님을 위해 드리는 작은 선물입니다.\r\n\r\n#fUI/UIWindow.img/QuestIcon/4/0#\r\n#i"+riding+"# #z"+riding+"#");
                } else {
                    cm.sendNext("죄송하지만 인벤토리 공간이 충분하지 않으신 것 같네요. #b소비#k탭의 인벤토리 공간을 비워주세요.");
                }
                cm.dispose();
	    } else if (select == 2) {
		if (cm.canHold(5000000)) {
		    cm.BuyPET(pet);
                    cm.gainItem(need, -30);
	      cm.updateChar();
		    cm.sendNext(""+image+"를 정말로 저에게 주시는 건가요? 사실 그렇게 가치가 큰 것도 아니지만 저를 믿어준 #h #님을 위해 드리는 작은 선물입니다.#k\r\n\r\n#fUI/UIWindow.img/QuestIcon/4/0#\r\n#i"+pet+"# #z"+pet+"#");
                } else {
                    cm.sendNext("죄송하지만 인벤토리 공간이 충분하지 않으신 것 같네요. #b캐시#k탭의 인벤토리 공간을 비워주세요.");
                }
                cm.dispose();        
            } else {
                cm.dispose();
            }
        } else { 
            cm.dispose();
        }
    }
}